// Зміні\Види

    let // Зміна яку можна змінювати
    const sigma = 2; // Зміна яку не можна змінювати, наприклад щоб ніхто не взламав нічого

//

// Оператори\Операнди

    typeof // Оператор завдяки якого можна дізнатися тип данних
    console.log(2 + 2); // 2 це операнда, + це оператор
    // Оператори:

    

    

    //          ЛОГІЧНІ ОПЕРАТОР             //

    // == Оператор рівності. Порівнює лише вихідні значення. (5 == "5") = true
    // === Оператор строгої рівності. Порівнює вихідні значення та типи данних. (5 == "5") = false
    // != (5 != "5") = false
    // !== (5 !== "5") = true

    // && Оператор і/And, якщо одне з двох значень не вірне то повертається false.
    // || Оператор Або/Or, якщо одне з двох значень true то повертає true, в інших випадках false.
    // ! Оператоп Не/Not, замінює операнд на протилежне йому значення

    // ... = {умова} ? {вираз if true} : {вираз if false}; Тернарний оператор, спрощення if/else
//

// Тип данних\примітиви

    const coast = 2 // Number
    const userName = "Jaris" // String
    const isActive = true/false // Boolean
    const currentProduct = null  // Null, якщо користувач нічого не обрав

//

// Методи

    alert() // Вивести попередження
    prompt() // Запитати у користувача дані і повернути строку в змуні і тд
    confirm() // Теж саме що alert але задає питання true or false та повертає в залежності від вибору користувача
    length() // Вираховує кільк. символів в рядку
    toLowerCase() // Повертає рядок преобразования в нижній регістр
    toUpperCase() // Повертає рядок преобразования в верхній регістр
    indexOf() // Повертає позицію елемента
    includes() // Повертає true or false в залежності від того, є в рядку те слово чи немає
    startsWith() // Повертає true or false в залежності від того, чи повертається рядок з певних символів
    endWith() // Повертає true or false в залежності від того, чи завершується рядок з певних символів
    trim() // Видаляє пробіли з кінця та початку.
    padStart()
    padEnd()
    slice() // Вирізає символи, "JavaScript".slice(0,3) = Java
    substr() // Вирізає символи від першого заданого значення, "JavaScript".substr(3,1) = S
    replace() // Заміняє тільки одне слово, "Java! Java!".replace('Java', 'HTML') = HTML! Java!
    replaceAll() // Заміняє всі слова, "Java! Java!".replace('Java', 'HTML') = HTML! HTML!
    repeat()
    charAt() // Повертає символ з певної строки cha
//